In [3]:
import pandas as pd

In [4]:
a = pd.read_csv(r"C:\Users\Admin\Downloads\ethnic_diversity_data.csv")

a

,Employee_Name,EmpID,Position,State,Zip,Sex,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,Black or African American
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170,F,Married,US Citizen,Terminated for Cause,Admin Offices,47822.00,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...
305,"Daniele, Ann",1411071312,Sr. Network Engineer,CT,6033,F,Married,US Citizen,Leave of Absence,IT/IS,37619.01,38,White
306,"Lajiri, Jyoti",1108028108,Sr. Network Engineer,MA,2169,M,Married,US Citizen,Leave of Absence,IT/IS,27603.00,34,White
307,"Semizoglou, Jeremiah",904013591,Sr. Network Engineer,MA,1545,M,Married,US Citizen,Future Start,IT/IS,27587.46,24,Asian
308,"South, Joe",1308060959,Sr. Network Engineer,CT,6278,M,Single,US Citizen,Active,IT/IS,12126.53,31,White
309,"Warfield, Sarah",1301052347,Sr. Network Engineer,MA,2453,F,Widowed,US Citizen,Active,IT/IS,37257.00,46,Asian

In [14]:
a.columns

Index(['Employee_Name', 'EmpID', 'Position', 'State', 'Zip', 'Sex',
       'MaritalDesc', 'CitizenDesc', 'EmploymentStatus', 'Department',
       'Salaries', 'age', 'Race'],
      dtype='object')

In [5]:
# 1. What is minumum salary in the dataset?

In [17]:
a['Salaries'].min()

0.0

In [6]:
# 2. How many employers are there without marriage i.e. Single?

In [19]:
len(a[a['MaritalDesc']== 'Single'])

137

In [7]:
# 3. What is the average salary of employees?

In [20]:
a['Salaries'].mean()

36670.10274193549

In [8]:
# 4. What are the different positions in dataset?

In [21]:
a['Position'].unique()

array(['Accountant I', 'Administrative Assistant', 'Area Sales Manager',
       'BI Developer', 'BI Director', 'CIO', 'Data Architect',
       'Database Administrator', 'Data Analyst', 'Data Analyst ',
       'Director of Operations', 'Director of Sales', 'IT Director',
       'IT Manager - DB', 'IT Manager - Infra', 'IT Manager - Support',
       'IT Support', 'Network Engineer', 'President & CEO',
       'Production Manager', 'Production Technician I',
       'Production Technician II', 'Sales Manager', 'Senior BI Developer',
       'Shared Services Manager', 'Software Engineer',
       'Software Engineering Manager', 'Sr. Accountant', 'Sr. DBA',
       'Enterprise Architect', 'Principal Data Architect',
       'Sr. Network Engineer'], dtype=object)

In [9]:
# 5. Get all the details of eployee who is getting highest salary?

In [37]:
a['Salaries'].max()

108304.0

In [50]:
a[a['Salaries']==108304]

,Employee_Name,EmpID,Position,State,Zip,Sex,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
216,"Kinsella, Kathleen",710007401,Production Technician I,MA,2170,F,Married,US Citizen,Voluntarily Terminated,Production,108304.0,27,White

In [10]:
# 6. Which 'department' has more employees?

In [38]:
a['Department'].value_counts()

Production              208
IT/IS                    50
Sales                    31
Admin Offices            10
Software Engineering     10
Executive Office          1
Name: Department, dtype: int64

In [11]:
# 7. How many 'female' employees are working in the company?

In [34]:
len(a[a['Sex']=='F'])

177

In [12]:
# 8. Who are the 'empIDs' 'Non-Citizen' of us (.'citizenDesc' column)

In [47]:
a.loc[(a['CitizenDesc']== 'Non-Citizen'), ['EmpID']]

          EmpID
165  1012023295
222  1405067501
271  1207046956
297  1102024057

In [51]:
# 9. What is the average salary of employees who are Asian (refer: 'Race' column)

In [58]:
a[a['Race']== 'Asian'] ['Salaries'].mean()

40662.373235294115

In [56]:
# 10. Show all the employs who is not currently working in the company (check'Employmentstatus` column)?

In [60]:
a.loc[(a['EmploymentStatus']!= 'Active'),['Employee_Name']]

              Employee_Name
3           Howard, Estelle
5          Smith, Leigh Ann
6          Bunbury, Jessica
11          Gill, Whitney
13          Guilianno, Mike
..                      ...
303         Favis, Donald
304        Roehrich, Bianca
305          Daniele, Ann
306          Lajiri,  Jyoti
307  Semizoglou, Jeremiah

[128 rows x 1 columns]